export const TemplateEnum = [
  {
    desc: '使用说明：3组信息构成，每组自上而下包含图片+标题+简介',
    tips: '使用建议：适用于核心特征介绍、提炼信息',
  },
  {
    desc:
      '使用说明：左文+右图为一组，不限组数，每增加一组，第二组图文位置左右轮换',
    tips: '使用建议：适用于产品详情介绍',
  },
  {
    desc: '使用说明：左侧大图展示，右侧2组文字简介',
    tips: '使用建议：适用于产品详情介绍',
  },
  {
    desc: '使用说明：每组信息由图+标题简介构成，可支持四组信息',
    tips: '使用建议：适用于核心特征介绍、提炼信息',
  },
  {
    desc: '使用说明：每组信息由标题+简介构成，无配图，可支持展示3组/6组信息',
    tips: '使用建议：适用于产品特征介绍',
  },
  {
    desc: '使用说明：由5张图片组成，可支持展示5张/10张图片',
    tips: '使用建议：适用于展示logo信息',
  },
];
